{
    "_id":{
       "$oid":"649fc0538e139ed02941da29"
    },
    "owner":{
       "$oid":"649fb8cb80d8641bf4cfabf9"
    },
    "title":"Entire villa hosted by BeautifulPlaces",
    "address":"Santa Rosa, California, United States",
    "photos":[
       "https://airbnbclone-aa.s3.amazonaws.com/1688191018287.webp",
       "https://airbnbclone-aa.s3.amazonaws.com/1688191018403.webp",
       "https://airbnbclone-aa.s3.amazonaws.com/1688191018702.webp",
       "https://airbnbclone-aa.s3.amazonaws.com/1688191018788.webp",
       "https://airbnbclone-aa.s3.amazonaws.com/1688191018907.webp",
       "https://airbnbclone-aa.s3.amazonaws.com/1688191019131.webp",
       "https://airbnbclone-aa.s3.amazonaws.com/1688191019201.webp",
       "https://airbnbclone-aa.s3.amazonaws.com/1688191019286.webp"
    ],
    "description":"Soak up panoramas of the entire Sonoma Valley from this luxurious contemporary Sonoma Mountain home. The 4-bedroom, 4.5-bathroom brand new retreat delivers spectacular sights from every window, especially at sunset, when the sky fades into shades of orange, red, pink, and purple. The main house has an open kitchen, spacious living room and dining area looking out on the pool with visibility for miles. A detached 1-bedroom private guest house offers standalone privacy and more jaw-dropping views.",
    "perks":[
       "wifi",
       "parking",
       "entrance",
       "pets",
       "tv"
    ],
    "extraInfo":"Why BeautifulPlaces?\nBeautifulPlaces is the leading villa rental agency in California’s wine country. Experts on the ins and outs of Sonoma and Napa Valley, we strive to deliver the best possible vacation rental experience for you before, during and after your stay. Not only are we available by phone 24/7 should any issues arise at the property, we provide concierge services to share with you the top restaurants, wineries, and activities in the region. We are also happy to arrange pre-arrival shopping, private chefs and other in-villa services upon request. Committed to the highest standards, we personally inspect and approve the villas before your arrival to ensure a seamless, hassle-free holiday.",
    "checkIn":{
       "$numberInt":"8"
    },
    "checkOut":{
       "$numberInt":"5"
    },
    "maxGuests":{
       "$numberInt":"4"
    },
    "price":{
       "$numberInt":"100"
    },
    "__v":{
       "$numberInt":"0"
    }
 }